{"backend": "tensorflow", "keras_version": "2.1.6", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"data_format": "channels_last", "dilation_rate": [1, 1], "use_bias": true, "activation": "relu", "bias_constraint": null, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "filters": 32, "activity_regularizer": null, "name": "conv2d_1", "bias_regularizer": null, "batch_input_shape": [null, 57, 47, 1], "padding": "valid", "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1]}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "dilation_rate": [1, 1], "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_2", "filters": 32, "padding": "valid", "kernel_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_size": [3, 3], "strides": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "padding": "valid", "strides": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "rate": 0.25, "trainable": true, "seed": null, "noise_shape": null}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "units": 128, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "rate": 0.5, "trainable": true, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}}, "bias_constraint": null, "activation": "softmax", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_2", "units": 40, "kernel_regularizer": null, "trainable": true, "kernel_constraint": null}}]}