{"config": [{"config": {"activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_1", "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "strides": [1, 1], "padding": "valid", "batch_input_shape": [null, 64, 64, 1], "kernel_regularizer": null, "kernel_size": [5, 5], "filters": 16, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dtype": "float32", "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_2", "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "padding": "valid", "strides": [1, 1], "kernel_regularizer": null, "kernel_size": [5, 5], "filters": 32, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_3", "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "padding": "valid", "strides": [1, 1], "kernel_regularizer": null, "kernel_size": [4, 4], "filters": 64, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_3", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "name": "conv2d_4", "dilation_rate": [1, 1], "use_bias": true, "kernel_constraint": null, "padding": "valid", "strides": [1, 1], "kernel_regularizer": null, "kernel_size": [5, 5], "filters": 120, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "Conv2D"}, {"config": {"noise_shape": null, "name": "dropout_1", "rate": 0.25, "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"data_format": "channels_last", "name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "relu", "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "name": "dense_1", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 84, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "Dense"}, {"config": {"noise_shape": null, "name": "dropout_2", "rate": 0.5, "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"activation": "softmax", "bias_regularizer": null, "kernel_regularizer": null, "bias_constraint": null, "name": "dense_2", "activity_regularizer": null, "use_bias": true, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 6, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true}, "class_name": "Dense"}], "keras_version": "2.1.6", "backend": "tensorflow", "class_name": "Sequential"}